# Taps
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

# Core tools
brew "git"
brew "stow"
brew "tmux"
brew "ansible"

# CLI utilities
brew "bat"
brew "fd"
brew "fzf"
brew "gh"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "wget"
brew "zplug"
brew "zsh-vi-mode"

# Development
brew "arduino-cli"
brew "awscli"
brew "azure-cli"
brew "cmake"
brew "cocoapods"
brew "coursier"
brew "deno"
brew "docker-compose"
brew "emscripten"
brew "flyway"
brew "just"
brew "meson"
brew "n"
brew "ninja"
brew "node"
brew "nvm"
brew "openjdk"
brew "pgcli"
brew "pipenv"
brew "pnpm"
brew "poetry"
brew "pyenv"
brew "rbenv"
brew "ruby"
brew "ruby-build"
brew "serverless"
brew "virtualenv"
brew "watchman"

# Libraries (commonly needed as dependencies)
brew "aom"
brew "boost"
brew "cairo"
brew "fontconfig"
brew "freetype"
brew "glib"
brew "gnupg"
brew "harfbuzz"
brew "imagemagick"
brew "libpq"
brew "libyaml"
brew "lua"
brew "luajit"
brew "openssl@3"
brew "pango"
brew "pcre2"
brew "sqlite"
brew "tree-sitter"
brew "webp"

# Misc tools
brew "bpython"
brew "cmatrix"
brew "cowsay"
brew "fortune"
brew "ghostscript"
brew "git-filter-repo"
brew "glances"
brew "gobuster"
brew "graphicsmagick"
brew "gron"
brew "ipython"
brew "leptonica"
brew "mercurial"
brew "nmap"
brew "peco"
brew "picocom"
brew "pwgen"
brew "rename"
brew "rtorrent"
brew "screenresolution"
brew "skhd"
brew "terminal-notifier"
brew "tesseract"
brew "tmate"
brew "watch"
brew "xdotool"
brew "yabai"
brew "yt-dlp"

# Casks - Apps
cask "alt-tab"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"
cask "cursor"
cask "docker"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "macfuse"
cask "netron"
cask "ngrok"
cask "obs"
cask "raycast"
cask "stats"

# Casks - Nerd Fonts
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-m+-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
