tap "homebrew/core"
tap "homebrew/cask"

# formulae
brew "git"
brew "stow"
brew "tmux"

# Utils
brew "ansible"
brew "aom"
brew "arduino-cli"
brew "autoconf"
brew "awscli"
brew "awslogs"
brew "azure-cli"
brew "bat"
brew "boost"
brew "bpython"
brew "brotli"
brew "butterfish"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cffi"
brew "cmake"
brew "cmatrix"
brew "cocoapods"
brew "coursier"
brew "cowsay"
brew "cryptography"
brew "deno"
brew "docker"
brew "dooit"
brew "double-conversion"
brew "edencommon"
brew "emscripten"
brew "expat"
brew "fastlane"
brew "fb303"
brew "fbthrift"
brew "fd"
brew "fizz"
brew "flyway"
brew "fmt"
brew "folly"
brew "fontconfig"
brew "fortune"
brew "freetype"
brew "fribidi"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gflags"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "git"
brew "git-filter-repo"
brew "glances"
brew "glib"
brew "glog"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "gobuster"
brew "graphicsmagick"
brew "graphite2"
brew "gron"
brew "harfbuzz"
brew "highway"
brew "htop"
brew "icu4c@74"
brew "icu4c@76"
brew "icu4c@77"
brew "imagemagick"
brew "imath"
brew "ipython"
brew "jaq"
brew "jasper"
brew "jbig2dec"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "just"
brew "krb5"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libidn"
brew "libidn2"
brew "libksba"
brew "liblinear"
brew "liblqr"
brew "libmagic"
brew "libnghttp2"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libpthread-stubs"
brew "libraw"
brew "libsodium"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libtorrent-rakshasa"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvmaf"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxfixes"
brew "libxi"
brew "libxinerama"
brew "libxkbcommon"
brew "libxrender"
brew "libxtst"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "lua"
brew "luajit"
brew "lz4"
brew "lzo"
brew "m4"
brew "mac-cleanup-py"
brew "markdown"
brew "mercurial"
brew "meson"
brew "mongodb-database-tools"
brew "mono"
brew "mpdecimal"
brew "msgpack"
brew "n"
brew "ncurses"
brew "neofetch"
brew "nettle"
brew "ninja"
brew "nmap"
brew "node"
brew "npth"
brew "nvm"
brew "oniguruma"
brew "opencode"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "openssl@3"
brew "p11-kit"
brew "pango"
brew "pcre2"
brew "peco"
brew "pgcli"
brew "picocom"
brew "pinentry"
brew "pipenv"
brew "pixman"
brew "pkg-config"
brew "pkgconf"
brew "pnpm"
brew "poetry"
brew "pwgen"
brew "pycparser"
brew "pyenv"
brew "python-certifi"
brew "python-cryptography"
brew "python-packaging"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "rbenv"
brew "readline"
brew "rename"
brew "ripgrep"
brew "rtorrent"
brew "ruby"
brew "ruby-build"
brew "screenresolution"
brew "serverless"
brew "shared-mime-info"
brew "skhd"
brew "snappy"
brew "sqlite"
brew "sshfs-mac"
brew "stow"
brew "supabase"
brew "terminal-notifier"
brew "tesseract"
brew "tldr"
brew "tmate"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "unbound"
brew "utf8proc"
brew "virtualenv"
brew "wangle"
brew "watch"
brew "watchman"
brew "webp"
brew "wget"
brew "x265"
brew "xdotool"
brew "xkeyboard-config"
brew "xkeyboardconfig"
brew "xmlrpc-c"
brew "xorgproto"
brew "xxhash"
brew "xz"
brew "yabai"
brew "youtube-dl"
brew "yuicompressor"
brew "zplug"
brew "zsh-vi-mode"
brew "zstd"


# brew "neovim"

# casks
brew "alt-tab"
brew "android-commandlinetools"
brew "android-platform-tools"
brew "android-studio"
brew "font-3270-nerd-font"
brew "font-agave-nerd-font"
brew "font-anonymice-nerd-font"
brew "font-arimo-nerd-font"
brew "font-aurulent-sans-mono-nerd-font"
brew "font-bigblue-terminal-nerd-font"
brew "font-bitstream-vera-sans-mono-nerd-font"
brew "font-blex-mono-nerd-font"
brew "font-caskaydia-cove-nerd-font"
brew "font-code-new-roman-nerd-font"
brew "font-cousine-nerd-font"
brew "font-daddy-time-mono-nerd-font"
brew "font-dejavu-sans-mono-nerd-font"
brew "font-droid-sans-mono-nerd-font"
brew "font-fantasque-sans-mono-nerd-font"
brew "font-fira-code-nerd-font"
brew "font-fira-mono-nerd-font"
brew "font-go-mono-nerd-font"
brew "font-gohufont-nerd-font"
brew "font-hack-nerd-font"
brew "font-hackgen-nerd"
brew "font-hasklug-nerd-font"
brew "font-heavy-data-nerd-font"
brew "font-hurmit-nerd-font"
brew "font-im-writing-nerd-font"
brew "font-inconsolata-go-nerd-font"
brew "font-inconsolata-lgc-nerd-font"
brew "font-inconsolata-nerd-font"
brew "font-iosevka-nerd-font"
brew "font-jetbrains-mono-nerd-font"
brew "font-lekton-nerd-font"
brew "font-liberation-nerd-font"
brew "font-m+-nerd-font"
brew "font-meslo-lg-nerd-font"
brew "font-monofur-nerd-font"
brew "font-monoid-nerd-font"
brew "font-mononoki-nerd-font"
brew "font-mplus-nerd-font"
brew "font-noto-nerd-font"
brew "font-open-dyslexic-nerd-font"
brew "font-overpass-nerd-font"
brew "font-profont-nerd-font"
brew "font-proggy-clean-tt-nerd-font"
brew "font-roboto-mono-nerd-font"
brew "font-sauce-code-pro-nerd-font"
brew "font-shure-tech-mono-nerd-font"
brew "font-space-mono-nerd-font"
brew "font-terminess-ttf-nerd-font"
brew "font-tinos-nerd-font"
brew "font-ubuntu-mono-nerd-font"
brew "font-ubuntu-nerd-font"
brew "font-victor-mono-nerd-font"
brew "hiddenbar"
brew "iterm2"
brew "itsycal"
brew "karabiner-elements"
brew "macfuse"
brew "netron"
brew "ngrok"
brew "obs"
brew "raycast"
brew "stats"



